# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать
# функцию type() для проверки типа. Элементы списка можно не запрашивать
# у пользователя, а указать явно, в программе.

l1 = [1, 2.5, "khvjgvk", [2, 3], ("kjhb", 2), {"x": "y"}]

for i in l1:
    print(type(i))

