"""3. Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка. В его конструкторе
инициализировать параметр, соответствующий количеству клеток (целое число). В классе должны быть реализованы методы
перегрузки арифметических операторов: сложение (__add__()), вычитание (__sub__()), умножение (__mul__()),
деление (__truediv__()).Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение,
умножение и обычное (не целочисленное) деление клеток, соответственно. В методе деления должно осуществляться
округление значения до целого числа.

Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.

Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух клеток больше
нуля, иначе выводить соответствующее сообщение.

Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение количества ячеек этих
двух клеток.

Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества
ячеек этих двух клеток.

В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду. Данный
метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order()
вернет строку: *****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5.
Тогда метод make_order() вернет строку: *****\n*****\n*****."""


class Cell:

    def __init__(self, number):
        self.number = number

    def __add__(self, other):
        new_cell = self.number + other.number
        self.number = None
        other.number = None
        return Cell(new_cell)

    def __sub__(self, other):
        if self.number > other.number:
            new_cell = self.number - other.number
            return Cell(new_cell)
        else:
            print("less than zero")

    def __mul__(self, other):
        new_cell = self.number * other.number
        return Cell(new_cell)

    def __truediv__(self, other):
        new_cell = round(self.number / other.number)
        return Cell(new_cell)

    def make_order(self, lots):
        x = self.number
        y = lots
        l_1 = []
        while x > y:
            x = x - y
            l_1.append(y)
        l_1.append(x)

        res_str = ""
        for i in range(len(l_1)):
            lots_str = "*" * l_1[i]
            res_str += lots_str + "\n"
        return res_str


cell_1 = Cell(5)
cell_2 = Cell(3)

cell_3 = cell_1.__add__(cell_2)
print(cell_3.number)
cell_4 = cell_1.__sub__(cell_2)
print(cell_4.number)
cell_5 = cell_1.__mul__(cell_2)
print(cell_5.number)
cell_6 = cell_1.__truediv__(cell_2)
print(cell_6.number)
c = Cell
print(c.make_order(cell_1, 3))
